{
    "id": 2509734645,
    "number": 1398,
    "title": "Please, provide a howto on running multiple instances for multiple organizations",
    "body": "**Is your feature request related to a problem? Please describe.**\r\n\r\nMicrosoft teams web edition is not helpful at all when you are in multiple organizations. It does not let you manage the log in via the different accounts gracefully. You can only be logged in on one account at a time. This makes the switch unpractical and makes you loose the notifications from the account you are not logged in to.\r\n\r\nThis teams for linux application lets you work around the issue by running multiple instances of the application at the same time, each logged in to a different account, which is great.\r\n\r\nUnfortunately, the documentation on how to do it is dispersed among the comments in multiple bug reports.\r\n\r\n**Describe the solution you'd like**\r\n\r\nWould be great to have a howto file (possibly linked in the main readme) with instructions to follow in order to make the multiple instances work, also answering some questions that the users might have. For instance:\r\n\r\n1. It the \"config folder location\" mentioned in the `KNOWN_ISSUES.md` file the same thing as the user directory in the `--customuserdir` parameter?\r\n2. What is the difference among using 2 custom user dirs and different electron partitions as suggested in https://github.com/IsmaelMartinez/teams-for-linux/issues/438#issuecomment-1717507135. Does the latter work at all?\r\n3. Are there different instructions to be followed depending on how you have installed teamsforlinux (deb, arch/aur, flatpak, etc.)?\r\n4. Do you actually need different desktop files?\r\n5. What are the `WM_CLASS` and the `--class` parameter? Do they work the same in different desktops (gnome/KDE, etc)?\r\n6. Most important: often you receive teams invitations via email (invitation to teams or to meetings). How do you assure that when you click on the link you get to the correct teams instance? I guess you need the link to be associated to the two \"desktop files\" so that a dialog is shown to pick the correct one, but how?\r\n\r\n**Describe alternatives you've considered**\r\nN/A\r\n\r\n**Additional context**\r\nObviously, there is a risk that once a howto is put together Microsoft will finally fix the management of multiple organizations in the web client making the howto not relevant. But because there is no way to know what Microsoft will do, I think that preparing the howto would be worthy.",
    "state": "closed",
    "created_at": "2024-09-06T07:34:20+00:00",
    "updated_at": "2025-01-16T09:34:45+00:00",
    "closed_at": "2025-01-16T09:34:45+00:00",
    "user": "callegar",
    "assignee": null,
    "labels": [
        "documentation",
        "Stale"
    ],
    "comments_count": 8,
    "html_url": "https://github.com/IsmaelMartinez/teams-for-linux/issues/1398",
    "is_pull_request": false
}