{
    "id": 3140500366,
    "number": 1728,
    "title": "[Feat]: Disable pressing \"Enter\" to send message",
    "body": "### Describe the feature\n\nFor YEARS Teams has made the ENTER key the default \"Send Message\" action.  This leads to MANY inadvertant sends when the user really just wants a new line.\n\n### Motivation\n\nSome many times I just want a new line and get a send message.  Forget to just get a new line is SHIFT-ENTER.  Makes me feel SO STUPID to send partial messages.  Seems like in fine MS fashion - this issue has been discussed for YEARS without MS providing some parameter to all the user to determine what that user would like to have the \"Enter\" button do.\n\n### Alternatives\n\nOnce in a message if you type CTRL-SHIFT-X puts you into \"edit mode\" and enter works as enter without send.   This works fine - and actually gives the user more formatting options.  But the user must remember to press CTRL-SHIFT-X EVERY time they enter a new message OR the result is pressing Enter sends message.\n\n### Additional context\n\nCould you make it that once the user positions their cursor into the text area for typing a message - your code behind the scenes detects the position of the users cursor - checks some user setting that you have provided - AND if the setting is \"SendMessageOnEnter=N\" - your code sends the CTRL-SHIFT-X key sequence to automatically put the message box in edit mode.  If the user setting is \"SendMessageOnEnter=Y\" - then the default \"Enter-Send\" would apply.\nWould this be possible ???\nBTW - I just hit ENTER a ton of times - AND - github does it right - my new feature request did not just post half way through my dissertation.  I actually have to click \"Create\" to post - What a concept MS !!! :-)",
    "state": "closed",
    "created_at": "2025-06-12T14:19:03+00:00",
    "updated_at": "2025-07-20T09:36:53+00:00",
    "closed_at": "2025-07-20T09:36:53+00:00",
    "user": "KKomara62",
    "assignee": "IsmaelMartinez",
    "labels": [
        "enhancement",
        "Stale"
    ],
    "comments_count": 3,
    "html_url": "https://github.com/IsmaelMartinez/teams-for-linux/issues/1728",
    "is_pull_request": false
}