{
    "id": 2851740816,
    "number": 1571,
    "title": "[Bug]: Trouble Joining External Meeting with Meeting ID and 'Request to Join' - Possible Configuration Issue?",
    "body": "### Can you reproduce this bug in the PWA?\n\nNo\n\n### Describe the bug\n\nI am unable to join external Teams meetings that require the \"Request to Join\" feature when using a Meeting ID and Passcode in the teams-for-linux client. After entering the Meeting ID and Passcode, I do not see a \"Request to Join\" button or any indication that I'm in a lobby waiting to be admitted. Instead, I receive an error message.\n\n### What package are you using?\n\nflatpak\n\n### Version\n\n1.12.7\n\n### Reproduction steps\n\n```markdown\n1.Receive an invitation to an external Teams meeting that provides a Meeting ID and Passcode and explicitly states that I need to \"Request to join\" the meeting.\n2.Open the teams-for-linux client.\n3.Attempt to join the meeting using the \"Join with Meeting ID\" feature.\n4. Enter the provided Meeting ID and Passcode.\n5. Observe that there is no \"Request to Join\" button or any indication of being placed in a lobby.\n6. The client displays the error message: \"Używane konto nie ma dostępu do tego spotkania ze względu na zasady organizacji.\" (The account being used does not have access to this meeting due to organization policies).\n```\n\n### Expected Behavior\n\n```markdown\nAfter entering the Meeting ID and Passcode, the client should either:\n1. Display a \"Request to Join\" button that I can click to request entry to the meeting.\n2. Automatically place me in a virtual lobby and indicate that I am waiting for the meeting organizer to admit me.\n```\n\n### Debug\n\n```markdown\nI'm not sure how to effectively use the --webDebug option in this scenario, as the issue seems to be related to the client's handling of the Meeting ID and \"Request to Join\" process, rather than a specific web element. If you can provide more specific instructions on how to use --webDebug to diagnose this particular issue, I'm happy to try it.\n```\n\n### Additional context\n\nI am able to join the same meeting successfully using the Teams web app in my browser. In the web app, after entering the Meeting ID and Passcode, I am placed in a lobby, and there's a clear indication that I need to \"Request to Join\" before being admitted.\n\nI initially tried creating an event in the teams-for-linux client by pasting the meeting details into a new calendar entry. However, the resulting event doesn't seem to be \"joinable.\" When the meeting time arrives, I can't find a way to directly join the meeting from the event. It appears as a blank event. This may be a separate issue.",
    "state": "closed",
    "created_at": "2025-02-13T17:56:41+00:00",
    "updated_at": "2025-03-01T12:37:26+00:00",
    "closed_at": "2025-03-01T12:36:48+00:00",
    "user": "4Vertikal4",
    "assignee": "IsmaelMartinez",
    "labels": [
        "bug"
    ],
    "comments_count": 8,
    "html_url": "https://github.com/IsmaelMartinez/teams-for-linux/issues/1571",
    "is_pull_request": false
}